from aiogram.utils.formatting import Text, Bold, as_list, as_key_value, as_section, as_marked_list

AVAILABILITY_TEXT = Text('Щодо аналізу книгозабезпеченості Вашої дисципліни звертайтесь до відділу ',
                         'комплектування у кімнату 518 за графіком роботи бібліотеки, тел. 2-12, ',
                         'зав. сектором - Жирова Олена Анатоліївна, або поштою - lanos@zp.edu.ua')

CHAT_TEXT = Text('Для з\'єднання з черговим бібліотекарем активуйте бот @Bibliografs_bot\n',
                 '❗Зверніть увагу, що чат працює виключно в робочі години бібліотеки!')

EDD_MBA_TEXT = Text('Читачі нашої бібліотеки можуть БЕЗКОШТОВНО скористатися послугами ',
                    'міжбібліотечного абонемента (МБА) та електронної доставки документів (ЕДД).\n\n',
                    Bold('ЕДД:'), ' читачі бібліотеки можуть отримати електронною поштою ',
                    'копії статей із друкованих журналів, які передплачуються бібліотекою, або ',
                    'фрагменти книг, що зберігаються у фонді бібліотеки.\n\n',
                    Bold('МБА:'), ' замовленя і використання докуметів з фондів інших бібліотек.\n\n',
                    'Послугою МБА можуть користуватися будь-які читачі наукової бібліотеки Національного \n',
                    'університету "Запорізька політехніка": науково-педагогічні працівники, викладачі, ',
                    'співробітники та аспіранти університету, студенти.\n\n',
                    'Література, одержана по МБА, видається для користування тільки у читальному ',
                    'залі періодичних видань Наукової бібліотеки НУ "Запорізька політехніка" ',
                    '(ауд. 248-а, ІІ поверх головного корпусу університета) за встановленим порядком.')

FIND_LIT_TEXT = Text('Ви можете здійснювати пошук літератури через електронний каталог, ',
                      'електронну бібліотеку або репозитарій. Оберіть бажаний спосіб.\n\n',
                      'У разі виникнення запитань Ви можете розпочати чат із бібліотекарем ',
                      'за допомогою @Bibliografs_bot')

FOUNDS_TEXT = Text('Ви можете переглянути на сайті бібліотеки актуальні каталоги ',
                   'передплатних агенцій та видавництв⤵️')

HELP_TEXT = Text('Шановні читачі!\n',
                 'Вітаємо тих, у кого обмаль часу, щоб відвідати бібліотеку!!!\n\n',
                 'Ми:\n',
                 as_marked_list(
                     'робимо тематичний пошук інформації;',
                     'складаємо список літератури до реферату, контрольної, курсової роботи;',
                     'надаємо інформацію про наявність книг у бібліотеці;',
                     'надсилаємо електронні копії методичних посібників, конспектів лекцій, інших документів;',
                     'визначаємо індекс УДК до наукової роботи;',
                     'надаємо необхідну консультативну допомогу.'
                     ),
                     '\nДля цього заповніть, будь ласка, форму замовлення довідки.\n\n',
                     'Також приєднуйтеся до нашої групи "Online послуги - Наукова бібліотека НУ "Запорізька політехніка" (ЗНТУ)"👥')

LIBRARY_TEXT = Text('На даний час бібліотека налічує близько 12 800 назв навчальних посібників, книг, ',
                    'конспектів лекцій, статей, методичних вказівок та авторефератів дисертацій ',
                    'у електронному вигляді, 80% яких складають розробки викладачів та наукових працівників ',
                    'Національного університета "Запорізька політехніка".\n\n',
                    'Електронна бібліотека створена виключно для забезпечення навчально-виховної ',
                    'та науково-педагогічної діяльності університету.')

PROFILE_TEXT = Text('Звертайтесь до Пилипенко Наталії Володимирівни (Сектор інформаційних технологій ',
                    'та комп\'ютерного забезпечення, а.250, головний корпус). 📧Поштова скринька - ',
                    'natali_p@zp.edu.ua, 📞внутрішній телефон 4-10.\n\n',
                    'Даруємо корисні чек-листи📝💡')

PROMPT_TEXT = Text('Оберіть категорію, що Вас цікавить')

READY_TEXT = 'До Ваших послуг'

REGISTRY_TEXT = Text('Увага!\n\n', "❗Видання категорії 'B' - не фахові від 13.03.2020")

REPO_1_TEXT = Text('Для розміщення в інституційному репозитарії потрібно надіслати на спеціалізовану ',
                   'поштову скриньку файл повнотекстової публікації у ', Bold('pdf-форматі'),
                   ' та файл опису за Дублінським ядром у форматі ', Bold('.doc, .docx, .rtf'))

REPO_2_TEXT = Text('Для завантаження зразка оформлення опису за Дублінським ядром ',
                   '(наказ №26 від 26.04.2016) ', 'оберіть тип публікації')

REPO_MAIL_TEXT = Text('Деськова Ольга Іванівна\n', 'naukovabiblioteka@gmail.com')

RESOURCES_TEXT = Text('Ви можете здійснювати пошук літератури через електронний каталог, ',
                      'електронну бібліотеку або репозитарій. Оберіть бажаний спосіб')

SCHEDULE_TEXT = as_section('ТИМЧАСОВИЙ графік на час карантину:',
                           as_list(
                               as_key_value('Понеділок', '09:00 - 15:30'),
                               as_key_value('Вівторок', '09:00 - 15:30'),
                               as_key_value('Середа', '09:00 - 15:30'),
                               as_key_value('Четвер', '09:00 - 15:30'),
                               as_key_value("П'ятниця", '09:00 - 15:30'),
                               as_key_value('Субота', 'ЗАЧИНЕНО'),
                               as_key_value('Неділя', 'ЗАЧИНЕНО')
                           ))

SERVICES_TEXT = Text('Оберіть послугу, яку Ви можете отримати без відвідування бібліотеки')

SUPPORT_TEXT = Text('Звертайтесь до Пилипенко Наталії Володимирівни (Сектор інформаційних технологій ',
                    'та комп\'ютерного забезпечення, а.250, головний корпус). 📧Поштова скринька - ',
                    'natali_p@zp.edu.ua, 📞внутрішній телефон 4-10.')

TCS_TEXT = Text('Перед тим, як надсилати рукопис до редакції журналу, прочитайте буклет⤵️')

UDK_TEXT = Text('Ви можете зробити запит через форму замовлення Віртуальної довідки, натиснувши кнопку під цим постом.\n\n',
                'Або пишіть нам на поштову скриньку bibliografszntu@gmail.com.\n',
                'Обов\'язково вкажіть в листі наступну інформацію:\n',
                as_marked_list(
                    'ПІБ,',
                    'номер читацького квитка,',
                    'підрозділ / групу,',
                    'тему публікації для визначення УДК (бажано додати анотацію публікації для уточнення),',
                    'Ваші контактні дані для зворотного зв\'язку (телефон, поштова скринька).',
                ),
                '\n\nДякуємо за уважне виконання вимог!👍')

UNKNOWN_TEXT = 'Вибачте, я не розпізнав цю команду'

ZVO_TXT = Text('Шановні науковці!\n', 'Для коректної індексації ваших наукових здобутків ',
               'в наукометричних базах використовуйте ПРАВИЛЬНУ офіційну назву установи ',
               'англійською мовою, яка зазначена в Статуті (стор. 3):\n\n',
               Bold('National university Zaporizhzhia Polytechnic'),
               ' офіційне скорочення назви - ', Bold('NU Zaporizhzhia Politechnic'))

def greetings(name: str) -> Text:
    return Text('Вітаю, ', name, '!\n',
                'Я - Бот Наукової бібліотеки Національного університету "Запорізька політехніка"! ',
                'Завжди радий Вас бачити і готовий допомогти! Дарую Вам корисний буклет про бібліотеку.')